app/controllers/application_controller.rb

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_member
    @current_member ||= Member.find(session[:member_id]) if session[:member_id]