app/controllers/members_controller.rb

    def index
        @members = Member.order("id")
---
SELECT "members".* FROM "members" ORDER BY id

    def search
        @members = Member.search(params[:q])
---
SELECT "members".* FROM "members" WHERE (name LIKE '%山田%' OR full_name LIKE '%山田%') ORDER BY id

    def update
        @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]