app/controllers/sessions_controller.rb

    def create
        member = Member.find_by(name: params[:name])
---
SELECT  "members".* FROM "members" WHERE "members"."name" = ? LIMIT ?  [["name", "Taro"], ["LIMIT", 1]]